In [2]:
import pandas as pd
import seaborn as sns

In [4]:
df = sns.load_dataset('titanic')
df.columns

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'who', 'adult_male', 'deck', 'embark_town',
       'alive', 'alone'],
      dtype='object')

In [6]:
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [7]:
embark_town = df.embark_town

In [12]:
embark_town.head(10)

0    Southampton
1      Cherbourg
2    Southampton
3    Southampton
4    Southampton
5     Queenstown
6    Southampton
7    Southampton
8    Southampton
9      Cherbourg
Name: embark_town, dtype: object

In [16]:
embark_town.hasnans

True

In [17]:
embark_town.isnull().sum()

2

In [20]:
embark_town.str.len().head()

0    11.0
1     9.0
2    11.0
3    11.0
4    11.0
Name: embark_town, dtype: float64

In [23]:
embark_town.str.find("South").head()

0    0.0
1   -1.0
2    0.0
3    0.0
4    0.0
Name: embark_town, dtype: float64

In [27]:
embark_town.str.find("ampton").head()

0    5.0
1   -1.0
2    5.0
3    5.0
4    5.0
Name: embark_town, dtype: float64

In [24]:
embark_town.str.count("South").head()

0    1.0
1    0.0
2    1.0
3    1.0
4    1.0
Name: embark_town, dtype: float64

In [28]:
embark_town.str.count("ampton").head()

0    1.0
1    0.0
2    1.0
3    1.0
4    1.0
Name: embark_town, dtype: float64